eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_cmu.h
/***************************************************************************//**
 * @file
 * @brief Clock management unit (CMU) API
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#ifndef EM_CMU_H
#define EM_CMU_H

#include "em_device.h"
#if defined(CMU_PRESENT)

#include <stdbool.h>
#include "em_assert.h"
#include "em_bus.h"
#include "em_gpio.h"
#include "em_common.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup cmu
 * @{
 ******************************************************************************/

#if defined(_SILICON_LABS_32B_SERIES_2)

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2)
/* Enable register bit positions, for internal use. */
#define CMU_EN_BIT_POS             0U
#define CMU_EN_BIT_MASK            0x1FU

/* Enable register ID's for internal use. */
#define CMU_NO_EN_REG               0
#define CMU_CLKEN0_EN_REG           1
#define CMU_CLKEN1_EN_REG           2
#define CMU_CRYPTOACCCLKCTRL_EN_REG 3
#define CMU_EN_REG_POS              5U
#define CMU_EN_REG_MASK             0x3U

/* Clock branch ID's internal use. */
#define CMU_CORE_BRANCH            0
#define CMU_SYSCLK_BRANCH          1
#define CMU_SYSTICK_BRANCH         2
#define CMU_HCLK_BRANCH            3
#define CMU_EXPCLK_BRANCH          4
#define CMU_PCLK_BRANCH            5
#define CMU_LSPCLK_BRANCH          6
#define CMU_TRACECLK_BRANCH        7
#define CMU_EM01GRPACLK_BRANCH     8
#define CMU_EM01GRPBCLK_BRANCH     9
#define CMU_EUART0CLK_BRANCH       10
#define CMU_IADCCLK_BRANCH         11
#define CMU_EM23GRPACLK_BRANCH     12
#define CMU_WDOG0CLK_BRANCH        13
#define CMU_RTCCCLK_BRANCH         14
#define CMU_EM4GRPACLK_BRANCH      15
#define CMU_PDMREF_BRANCH          16
#define CMU_DPLLREFCLK_BRANCH      17
#define CMU_CLK_BRANCH_POS         7U
#define CMU_CLK_BRANCH_MASK        0x1FU
#endif  // defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2)

#if defined(_EMU_CMD_EM01VSCALE1_MASK)
/* Maximum clock frequency for VSCALE voltages. */
#define CMU_VSCALEEM01_LOWPOWER_VOLTAGE_CLOCK_MAX     40000000UL
#endif

/* Macros for VSCALE for use with the @ref CMU_UpdateWaitStates() API.
 * NOTE: The values must align with the values in EMU_VScaleEM01_TypeDef for
 * Series1 parts (highest VSCALE voltage = lowest numerical value). */
#define VSCALE_EM01_LOW_POWER           1
#define VSCALE_EM01_HIGH_PERFORMANCE    0

#if defined(LFRCO_PRECISION_MODE) && LFRCO_PRECISION_MODE
#define PLFRCO_PRESENT
#endif

/** @endcond */

/*******************************************************************************
 ********************************   ENUMS   ************************************
 ******************************************************************************/

/** Clock divider configuration */
typedef uint32_t CMU_ClkDiv_TypeDef;

/** HFRCODPLL frequency bands */
typedef enum {
  cmuHFRCODPLLFreq_1M0Hz            = 1000000U,         /**< 1MHz RC band.  */
  cmuHFRCODPLLFreq_2M0Hz            = 2000000U,         /**< 2MHz RC band.  */
  cmuHFRCODPLLFreq_4M0Hz            = 4000000U,         /**< 4MHz RC band.  */
  cmuHFRCODPLLFreq_7M0Hz            = 7000000U,         /**< 7MHz RC band.  */
  cmuHFRCODPLLFreq_13M0Hz           = 13000000U,        /**< 13MHz RC band. */
  cmuHFRCODPLLFreq_16M0Hz           = 16000000U,        /**< 16MHz RC band. */
  cmuHFRCODPLLFreq_19M0Hz           = 19000000U,        /**< 19MHz RC band. */
  cmuHFRCODPLLFreq_26M0Hz           = 26000000U,        /**< 26MHz RC band. */
  cmuHFRCODPLLFreq_32M0Hz           = 32000000U,        /**< 32MHz RC band. */
  cmuHFRCODPLLFreq_38M0Hz           = 38000000U,        /**< 38MHz RC band. */
  cmuHFRCODPLLFreq_48M0Hz           = 48000000U,        /**< 48MHz RC band. */
  cmuHFRCODPLLFreq_56M0Hz           = 56000000U,        /**< 56MHz RC band. */
  cmuHFRCODPLLFreq_64M0Hz           = 64000000U,        /**< 64MHz RC band. */
  cmuHFRCODPLLFreq_80M0Hz           = 80000000U,        /**< 80MHz RC band. */
  cmuHFRCODPLLFreq_UserDefined      = 0,
} CMU_HFRCODPLLFreq_TypeDef;

/** HFRCODPLL maximum frequency */
#define CMU_HFRCODPLL_MIN       cmuHFRCODPLLFreq_1M0Hz
/** HFRCODPLL minimum frequency */
#define CMU_HFRCODPLL_MAX       cmuHFRCODPLLFreq_80M0Hz

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)
/** HFRCOEM23 frequency bands */
typedef enum {
  cmuHFRCOEM23Freq_1M0Hz            = 1000000U,         /**< 1MHz RC band.  */
  cmuHFRCOEM23Freq_2M0Hz            = 2000000U,         /**< 2MHz RC band.  */
  cmuHFRCOEM23Freq_4M0Hz            = 4000000U,         /**< 4MHz RC band.  */
  cmuHFRCOEM23Freq_13M0Hz           = 13000000U,        /**< 13MHz RC band. */
  cmuHFRCOEM23Freq_16M0Hz           = 16000000U,        /**< 16MHz RC band. */
  cmuHFRCOEM23Freq_19M0Hz           = 19000000U,        /**< 19MHz RC band. */
  cmuHFRCOEM23Freq_26M0Hz           = 26000000U,        /**< 26MHz RC band. */
  cmuHFRCOEM23Freq_32M0Hz           = 32000000U,        /**< 32MHz RC band. */
  cmuHFRCOEM23Freq_40M0Hz           = 40000000U,        /**< 40MHz RC band. */
  cmuHFRCOEM23Freq_UserDefined      = 0,
} CMU_HFRCOEM23Freq_TypeDef;

/** HFRCOEM23 maximum frequency */
#define CMU_HFRCOEM23_MIN       cmuHFRCOEM23Freq_1M0Hz
/** HFRCOEM23 minimum frequency */
#define CMU_HFRCOEM23_MAX       cmuHFRCOEM23Freq_40M0Hz
#endif  // defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)

