eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_cmu.h
/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/
uint32_t                   CMU_Calibrate(uint32_t cycles,
                                         CMU_Select_TypeDef reference);
void                       CMU_CalibrateConfig(uint32_t downCycles,
                                               CMU_Select_TypeDef downSel,
                                               CMU_Select_TypeDef upSel);
uint32_t                   CMU_CalibrateCountGet(void);
void                       CMU_ClkOutPinConfig(uint32_t           clkno,
                                               CMU_Select_TypeDef sel,
                                               CMU_ClkDiv_TypeDef clkdiv,
                                               GPIO_Port_TypeDef  port,
                                               unsigned int       pin);
CMU_ClkDiv_TypeDef         CMU_ClockDivGet(CMU_Clock_TypeDef clock);
void                       CMU_ClockDivSet(CMU_Clock_TypeDef clock,
                                           CMU_ClkDiv_TypeDef div);
uint32_t                   CMU_ClockFreqGet(CMU_Clock_TypeDef clock);
CMU_Select_TypeDef         CMU_ClockSelectGet(CMU_Clock_TypeDef clock);
void                       CMU_ClockSelectSet(CMU_Clock_TypeDef clock,
                                              CMU_Select_TypeDef ref);
uint16_t                   CMU_LF_ClockPrecisionGet(CMU_Clock_TypeDef clock);
CMU_HFRCODPLLFreq_TypeDef  CMU_HFRCODPLLBandGet(void);
void                       CMU_HFRCODPLLBandSet(CMU_HFRCODPLLFreq_TypeDef freq);
bool                       CMU_DPLLLock(const CMU_DPLLInit_TypeDef *init);
void                       CMU_HFXOInit(const CMU_HFXOInit_TypeDef *hfxoInit);
void                       CMU_LFXOInit(const CMU_LFXOInit_TypeDef *lfxoInit);
void                       CMU_LFXOPrecisionSet(uint16_t precision);
uint32_t                   CMU_OscillatorTuningGet(CMU_Osc_TypeDef osc);
void                       CMU_OscillatorTuningSet(CMU_Osc_TypeDef osc,
                                                   uint32_t val);
void                       CMU_UpdateWaitStates(uint32_t freq, int vscale);

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2)
void                       CMU_ClockEnable(CMU_Clock_TypeDef clock, bool enable);
#endif

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)
CMU_HFRCOEM23Freq_TypeDef  CMU_HFRCOEM23BandGet(void);
void                       CMU_HFRCOEM23BandSet(CMU_HFRCOEM23Freq_TypeDef freq);
#endif

#if defined(PLFRCO_PRESENT)
void                       CMU_LFRCOSetPrecision(CMU_Precision_TypeDef precision);
#endif

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)
/***************************************************************************//**
 * @brief
 *   Enable/disable a clock.
 *
 * @note
 *   This is a dummy function to solve backward compatibility issues.
 *
 * @param[in] clock
 *   The clock to enable/disable.
 *
 * @param[in] enable
 *   @li true - enable specified clock.
 *   @li false - disable specified clock.
 ******************************************************************************/
__STATIC_INLINE void CMU_ClockEnable(CMU_Clock_TypeDef clock, bool enable)
{
  (void)clock;
  (void)enable;
}
#endif

/***************************************************************************//**
 * @brief
 *   Configures continuous calibration mode.
 * @param[in] enable
 *   If true, enables continuous calibration, if false disables continuous
 *   calibration.
 ******************************************************************************/
__STATIC_INLINE void CMU_CalibrateCont(bool enable)
{
  BUS_RegBitWrite(&CMU->CALCTRL, _CMU_CALCTRL_CONT_SHIFT, (uint32_t)enable);
}

/***************************************************************************//**
 * @brief
 *   Starts calibration.
 * @note
 *   This call is usually invoked after @ref CMU_CalibrateConfig() and possibly
 *   @ref CMU_CalibrateCont().
 ******************************************************************************/
__STATIC_INLINE void CMU_CalibrateStart(void)
{
  CMU->CALCMD = CMU_CALCMD_CALSTART;
}

/***************************************************************************//**
 * @brief
 *   Stop calibration counters.
 ******************************************************************************/
__STATIC_INLINE void CMU_CalibrateStop(void)
{
  CMU->CALCMD = CMU_CALCMD_CALSTOP;
}

/***************************************************************************//**
 * @brief
 *   Unlock the DPLL.
 * @note
 *   The HFRCODPLL oscillator is not turned off.
 ******************************************************************************/
__STATIC_INLINE void CMU_DPLLUnlock(void)
{
  DPLL0->EN_CLR = DPLL_EN_EN;
}

/***************************************************************************//**
 * @brief
 *   Clear one or more pending CMU interrupt flags.
 *
 * @param[in] flags
 *   CMU interrupt sources to clear.
 ******************************************************************************/
__STATIC_INLINE void CMU_IntClear(uint32_t flags)
{
  CMU->IF_CLR = flags;
}

/***************************************************************************//**
 * @brief
 *   Disable one or more CMU interrupt sources.
 *
 * @param[in] flags
 *   CMU interrupt sources to disable.
 ******************************************************************************/
__STATIC_INLINE void CMU_IntDisable(uint32_t flags)
{
  CMU->IEN_CLR = flags;
}

/***************************************************************************//**
 * @brief
 *   Enable one or more CMU interrupt sources.
 *
 * @note
 *   Depending on the use, a pending interrupt may already be set prior to
 *   enabling the interrupt. Consider using @ref CMU_IntClear() prior to
 *   enabling if such a pending interrupt should be ignored.
 *
 * @param[in] flags
 *   CMU interrupt sources to enable.
 ******************************************************************************/
__STATIC_INLINE void CMU_IntEnable(uint32_t flags)
{
  CMU->IEN_SET = flags;
}

/***************************************************************************//**
 * @brief
 *   Get pending CMU interrupt sources.
 *
 * @return
 *   CMU interrupt sources pending.
 ******************************************************************************/
__STATIC_INLINE uint32_t CMU_IntGet(void)
{
  return CMU->IF;
}

/***************************************************************************//**
 * @brief
 *   Get enabled and pending CMU interrupt flags.
 *
 * @details
 *   Useful for handling more interrupt sources in the same interrupt handler.
 *
 * @note
 *   The event bits are not cleared by the use of this function.
 *
 * @return
 *   Pending and enabled CMU interrupt sources.
 *   The return value is the bitwise AND of
 *   - the enabled interrupt sources in CMU_IEN and
 *   - the pending interrupt flags CMU_IF
 ******************************************************************************/
__STATIC_INLINE uint32_t CMU_IntGetEnabled(void)
{
  uint32_t ien;

